[
    {
        "character_name": "Shevek",
        "character_description": "An Anarresti physicist and the novel’s protagonist. Shevek is an idealist and a dreamer who longs to use his gifts as a physicist to reconcile the rival, twin planets of Urras and Anarres. As Shevek… read analysis of Shevek",
        "world": "Anarres"
    },
    {
        "character_name": "Takver",
        "character_description": "An Anarresti woman who becomes Shevek’s romantic partner. Brilliant, empathetic, and practical, Takver works in a marine laboratory where she studies fish. Shevek admires her kind heart, her belief that “all lives are in common,”… read analysis of Takver",
        "world": "Anarres"
    },
    {
        "character_name": "Rulag",
        "character_description": "Shevek’s mother. After receiving a work assignment which took her far away from Shevek and Palat, she never reconnected with her family, and so Shevek grows up without ever knowing Rulag. When Shevek comes down… read analysis of Rulag",
        "world": "Anarres"
    },
    {
        "character_name": "Bedap",
        "character_description": "One of Shevek’s closest friends since childhood. From a young age, Bedap expresses a desire to learn more about Urras, and to understand what the planet is really like. After a brief period of being… read analysis of Bedap",
        "world": "Anarres"
    },
    {
        "character_name": "Sabul",
        "character_description": "An Anarresti physicist at the Institute in Abbenay, and Shevek’s mentor. Based on the Anarresti principle of selflessness and no private property, Sabul co-opts Shevek’s ideas and attempts to keep him from communicating directly with… read analysis of Sabul –",
        "world": "Anarres"
    },
    {
        "character_name": "Atro",
        "character_description": "The foremost living physicist on Urras. A man of eighty, he moves and speaks with “the blunt self-assurance of one accustomed to respect.” Shevek and Atro have been communicating through letters for years by the… read analysis of Atro",
        "world": "Anarres"
    },
    {
        "character_name": "Chifoilisk",
        "character_description": "A Thuvian scientist on Urras. It is Chifoilisk who warns Shevek that he is being “bought” by the Ioti scientists, and advises him to be careful of Pae especially. Chifoilisk tells Shevek never to write… read analysis of Chifoilisk",
        "world": "Anarres"
    },
    {
        "character_name": "Kimoe",
        "character_description": "An Urrasti doctor who accompanies Shevek on his initial journey from Anarres to Urras. Kimoe provides Shevek with the necessary vaccines and medicine to make his transition to Urras easier. Kimoe is the first Urrasti… read analysis of Kimoe",
        "world": "Anarres"
    },
    {
        "character_name": "Beshun",
        "character_description": "A woman with whom Shevek, while posted to a job at an afforestation project in the desert region at eighteen years old, has a brief but intense sexual relationship. Beshun helps Shevek to see… read analysis of Beshun",
        "world": "Anarres"
    },
    {
        "character_name": "Mitis",
        "character_description": "The senior physicist at the Northsetting Institute. She is a compassionate and involved teacher, and attempts to warn Shevek about the possible pitfalls of working with Sabul: she tells Shevek that if he goes… read analysis of Mitis",
        "world": "Anarres"
    },
    {
        "character_name": "Efor",
        "character_description": "The butler and servant assigned to Shevek during his stay on Urras. At first Shevek is baffled by Efor’s role and laments the class divisions in Urrasti society that have put Efor in a place… read analysis of Efor",
        "world": "Urras"
    },
    {
        "character_name": "Vea Doem Oiie",
        "character_description": "Oiie’s sister, a beautiful and alluring Urrasti woman who is fascinated by Shevek and takes him under her wing. Shevek describes her as soft but affected, and pursues a friendship with her spurred partly by… read analysis of Vea Doem Oiie",
        "world": "Urras"
    },
    {
        "character_name": "Tuio Maedda",
        "character_description": "A Urrasti anarchist whom Shevek seeks out when he realizes that his work will become a property of the Ioti State. A middle-aged man with a “strained, intellectual” disposition, Tuio is a self-described enemy of… read analysis of Tuio Maedda",
        "world": "Urras"
    },
    {
        "character_name": "Keng",
        "character_description": "The Terran ambassador on Urras. Struck by the failure of Earth—whose population now hovers below half a billion—she sees Urras as a kind of paradise. Shevek tells her of his plans for the ansible… read analysis of Keng",
        "world": "Terra"
    },
    {
        "character_name": "Ketho",
        "character_description": "A Hainish commander on the Davenant, the ship returning Shevek to Anarres at the end of the novel. Ketho expresses to Shevek his desire to return to Anarres with him and to live among… read analysis of Ketho",
        "world": "Hain"
    },
    {
        "character_name": "Palat",
        "character_description": "Shevek’s father, a sad-eyed man who raised Shevek alone from infancy. Palat died when Shevek was just a teenager while attempting to rescue children caught in the rubble of a building destroyed in an earthquake—a perfect model of Anarresti selflessness.",
        "world": "Anarres"
    },
    {
        "character_name": "Gvarab –",
        "character_description": "An Anarresti scientist and teacher at the Institute in Abbenay. An elderly woman whose life’s work has revolved around theories of time and simultaneity, her classes are not well attended, and only Shevek seems to revere her work and her ideas.",
        "world": "Anarres"
    },
    {
        "character_name": "Saio Pae",
        "character_description": "A Urrasti physicist whom Shevek comes to see as his “enemy.” Duplicitous, opportunistic, and shady, Pae is loyal to the Ioti state but takes pride in his snakelike ability to find his way around rules and authority.",
        "world": "Anarres"
    },
    {
        "character_name": "Demaere Oiie",
        "character_description": "A Urrasti scientist from the state of A-Io and one of Shevek’s escorts and guides during his stay at Ieu Eun University, Oiie welcomes Shevek into his home on several occasions so that Shevek can experience Urrasti home life, and introduces Shevek to his freewheeling sister, Vea.",
        "world": "Urras"
    },
    {
        "character_name": "Tirin",
        "character_description": "One of Shevek’s childhood friends, and one of the masterminds behind a cruel experiment carried out by their friend group. After learning about the concept of prison, Shevek, Tirin, and Gibesh lock their friend Kadagv in a makeshift cell and leave him there for extended periods of time.",
        "world": "Anarres"
    },
    {
        "character_name": "Kadagv",
        "character_description": "One of Shevek’s childhood friends, and the victim of their friend group’s cruel prison experiment.",
        "world": "Anarres"
    },
    {
        "character_name": "Gibesh",
        "character_description": "The youngest of Shevek’s group of childhood friends.",
        "world": "Anarres"
    },
    {
        "character_name": "Desar",
        "character_description": "A mathematician and one of Shevek’s neighbors at the Institute in Abbenay. Though Desar is ordinarily aloof and unbrotherly, he helps care for Shevek in the wake of his brief illness.",
        "world": "Anarres"
    },
    {
        "character_name": "Sadik",
        "character_description": "Shevek and Takver’s firstborn daughter.",
        "world": "Anarres"
    },
    {
        "character_name": "Pilun",
        "character_description": "Shevek and Takver’s youngest daughter.",
        "world": "Anarres"
    }
]